from bot.types.utils import MessageSetting, ParseModes

from .keyboard import START_KEYBOARD

START_MESSAGE = MessageSetting(text='👋 Рады видеть Вас на нашей платформе\\!\n\nПлатформа Bazar \\- уникальна в своем роде\\.'
                                    '\nНа ней вы можете:'
                                    '\n🛍️ *Покупать* разные товары'
                                    '\n🏪 *Продавать* свои товары с описанием и фото'
                                    '\n💬 *Общаться* анонимно с продавцами/покупателями\n'
                                    '\n🎯 *Быстрый старт*:'
                                    '\n/seller _для перехода к меню продавца_'
                                    '\n/buyer _для перехода к меню покупателя️_'
                                    '\n/help _для получения помощи_\n'
                                    '\n💳 _Используйте кнопку, чтобы перейти к финансам_',
                               keyboard=START_KEYBOARD,
                               parse_mode=ParseModes.MARKDOWN_V2)
HELP_MESSAGE = MessageSetting(text='Help message')
